import csv
from random import randrange

ClubName=["Барселона","Реал Мадрид","Манчестер Юнайтед","Ювентус","Бавария","Галатасарай","Авангард","ЦСКА","Зенит","Спартак","Милан","Ливерпуль","Интер","Марсель","Боруссия","Тоттенхэм","Аякс","Рома","Кельн"]
ClubNameInt=len(ClubName)
CityName=["Андреаполь","Римини","Кингстон","Инсбрук","Братск","Эвора","Вестерос","Куэрнавака","Суракарта","Матаморос","Макурди","Порт-Харкорт","Балабаново","Торопец"]
CityNAmeInt=len(CityName)

Fio_f=["Ульян","Борислав","Евграф","Касьян","Стоян","Иво","Roel","Guido","Dwayne","Richard","Всеволод"]
Fio_fInt=len(Fio_f)

Fio_i=["Волошин","Жуков","Карабатов","Оропай","Племянников","Капитанчук","Огородников","Цветков","Василевич","Вадимович","Артёмович","Арнольдович","Тимурович"]
Fio_IInt=len(Fio_i)

Fio_o=["Валерьевич","Евгеньевич","Джорджович","Рамильевич","Александрович","Алексеевич","Вадимович","Геннадбевич",""]
Fio_OInt=len(Fio_o)
with open('DataBase.csv', 'w', newline='') as f:
    writer = csv.writer(f)
    writer.writerow(["названия клуба", "город"," количество набранных очков", "фамилия главного тренера"])
    for i in range(1,60000):
        writer.writerow([ClubName[randrange(0,ClubNameInt-1,1)],
                    CityName[randrange(0,CityNAmeInt-1,1)],
                    randrange(0,12,1),
                    Fio_f[randrange(1,Fio_fInt-1,1)],
                    Fio_i[randrange(0,Fio_IInt-1,1)],
                    Fio_o[randrange(0,Fio_OInt-1,1)]])


